app/views/orders/edit.html.erb

SELECT  "orders".* FROM "orders" WHERE "orders"."party_id" = $1 LIMIT 1  [["party_id", 1]]
SELECT "menu_items".* FROM "menu_items"
---
      <h2>Ticket</h2>
      <% @party.order.menu_items.each do |item| %>