app/controllers/menu_items_controller.rb

  def create
    menu_item = MenuItem.create menu_item_params
---
INSERT INTO "menu_items" ("name", "kind", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Nachos"], ["kind", "App"], ["price", 4], ["created_at", "2016-04-24 18:46:42.846879"], ["updated_at", "2016-04-24 18:46:42.846879"]]