app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."party_id" = $1 LIMIT 1  [["party_id", 1]]
---
  def show
    @order = @party.order

SELECT  "orders".* FROM "orders" WHERE "orders"."party_id" = $1 LIMIT 1  [["party_id", 1]]
SELECT "menu_items".* FROM "menu_items"
---
  def edit
    @order = @party.order

    menu_items = MenuItem.all

SELECT  "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = $1 LIMIT 1  [["id", 5]]
SELECT  "orders".* FROM "orders" WHERE "orders"."party_id" = $1 LIMIT 1  [["party_id", 2]]
---
  def add_menu_item
    menu_item = MenuItem.find params[:menu_item_id]

    @party.order.menu_items << menu_item if menu_item

SELECT  "menu_items_orders".* FROM "menu_items_orders" WHERE "menu_items_orders"."order_id" = 1 AND "menu_items_orders"."menu_item_id" = 4  ORDER BY "menu_items_orders"."id" ASC LIMIT 1
SELECT  "orders".* FROM "orders" WHERE "orders"."party_id" = $1 LIMIT 1  [["party_id", 1]]
DELETE FROM "menu_items" WHERE "menu_items"."id" = $1  [["id", 9]]
DELETE FROM "menu_items_orders" WHERE "menu_items_orders"."order_id" = $1 AND "menu_items_orders"."menu_item_id" = 2  [["order_id", 1]]
---
  def remove_menu_item
    line_item = MenuItemsOrders.where(order: @party.order, menu_item: params[:menu_item_id]).first

    line_item.destroy if line_item

SELECT  "parties".* FROM "parties" WHERE "parties"."id" = $1 LIMIT 1  [["id", 2]]
---
  def find_party
    @party ||= Party.find params[:party_id]