app/controllers/pages_controller.rb

SELECT "parties".* FROM "parties" WHERE "parties"."user_id" = 2
---
  def server
    @parties = Party.where(user: current_user)