app/controllers/parties_controller.rb

INSERT INTO "parties" ("name", "table_number", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "test"], ["table_number", 1], ["user_id", 2], ["created_at", "2016-04-24 19:10:58.315373"], ["updated_at", "2016-04-24 19:10:58.315373"]]
---
  def create
    _params = party_params.merge(user: current_user)

    party = Party.create _params

SELECT  "parties".* FROM "parties" WHERE "parties"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "parties" WHERE "parties"."id" = $1  [["id", 1]]
---
  def destroy
  party = Party.find(params[:id])
  party.destroy