app/controllers/users_controller.rb

  def create
    user = User.create user_params
---
INSERT INTO "users" ("username", "email", "password_digest", "admin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"